Service K6 & Stress Test
import { check } from "k6";
import http from "k6/http";

export  let options = {
  vus:500,        //virtual users
  rps:500,       //request per second
  duration:"3m"    //duration of the test
}

export default function() {
  var id = Math.ceil(Math.random() * 10000000);
    let res = http.get(`http://localhost:3010/restaurants/${id}/reviews`);
    check(res, {
        "is status 200": (r) => r.status === 200,
        "transaction time ok": (r) => r.timings.duration < 2000,
    });
};


    duration: 3m0s, iterations: -
         vus: 500,  max: 500

    done [==========================================================] 3m0s / 3m0s

    ✓ is status 200
    ✓ transaction time ok

    checks.....................: 100.00% ✓ 178610 ✗ 0    
    data_received..............: 60 MB   332 kB/s
    data_sent..................: 9.5 MB  53 kB/s
    http_req_blocked...........: avg=8.16µs  min=1µs      med=5µs     max=9.31ms p(90)=7µs     p(95)=14µs    
    http_req_connecting........: avg=1.76µs  min=0s       med=0s      max=7.22ms p(90)=0s      p(95)=0s      
    http_req_duration..........: avg=61.88ms min=775µs    med=2.29ms  max=1.82s  p(90)=42.36ms p(95)=571.09ms
    http_req_receiving.........: avg=32.15µs min=11µs     med=28µs    max=2.87ms p(90)=46µs    p(95)=55µs    
    http_req_sending...........: avg=27.35µs min=8µs      med=22µs    max=5.41ms p(90)=38µs    p(95)=48µs    
    http_req_tls_handshaking...: avg=0s      min=0s       med=0s      max=0s     p(90)=0s      p(95)=0s      
    http_req_waiting...........: avg=61.82ms min=732µs    med=2.24ms  max=1.82s  p(90)=42.31ms p(95)=571.03ms
    http_reqs..................: 89305   496.138548/s
    iteration_duration.........: avg=1s      min=250.64ms med=999.9ms max=2.72s  p(90)=1.01s   p(95)=1.05s   
    iterations.................: 89305   496.138548/s
    vus........................: 500     min=500  max=500
    vus_max....................: 500     min=500  max=500